## CSE-221710315024-LIKHITA YANAMADDI

### ASSIGNMENT-10[06-06-2020]

**1.If you find Unnamed column in the data remove that by filtering**

In [1]:
import pandas as pd
import numpy as np
df1 = pd.read_csv("data.csv",index_col=0)
df1

,Age,Sex,Job,Housing,Saving accounts,Checking account,Credit amount,Duration,Purpose
0,67,male,2,own,NaN,little,1169,6,radio/TV
1,22,female,2,own,little,moderate,5951,48,radio/TV
2,49,male,1,own,little,NaN,2096,12,education
3,45,male,2,free,little,little,7882,42,furniture/equipment
4,53,male,2,free,little,little,4870,24,car
...,...,...,...,...,...,...,...,...,...
995,31,female,1,own,little,NaN,1736,12,furniture/equipment
996,40,male,3,own,little,little,3857,30,car
997,38,male,2,own,little,NaN,804,12,radio/TV
998,23,male,2,free,little,little,1845,45,radio/TV
999,27,male,2,own,moderate,moderate,4576,45,car

**2.Display the top seven rows and last Three rows**

In [3]:
print("First 7 rows of the Dataframe : ")
print(df1.head(7))
print("last 3 rows of the Dataframe : ")
print(df1.tail(3))

First 7 rows of the Dataframe :
   Age     Sex  Job Housing Saving accounts Checking account  Credit amount  \
0   67    male    2     own             NaN           little           1169
1   22  female    2     own          little         moderate           5951
2   49    male    1     own          little              NaN           2096
3   45    male    2    free          little           little           7882
4   53    male    2    free          little           little           4870
5   35    male    1    free             NaN              NaN           9055
6   53    male    2     own      quite rich              NaN           2835

   Duration              Purpose
0         6             radio/TV
1        48             radio/TV
2        12            education
3        42  furniture/equipment
4        24                  car
5        36            education
6        24  furniture/equipment
last 3 rows of the Dataframe :
     Age   Sex  Job Housing Saving accounts Checking account  Credit amount  \
997   38  male    2     own          little              NaN            804
998   23  male    2    free          little           little           1845
999   27  male    2     own        moderate         moderate           4576

     Duration   Purpose
997        12  radio/TV
998        45  radio/TV
999        45       car

**3.Check the total number of entries you have**

In [7]:
df1.count()

Unnamed: 0          1000
Age                 1000
Sex                 1000
Job                 1000
Housing             1000
Saving accounts      817
Checking account     606
Credit amount       1000
Duration            1000
Purpose             1000
dtype: int64

**4.Check the No of features,Print features Names(Column Names)**

In [8]:
df2 = pd.read_csv("data.csv")   
for col in df2.columns: 
    print(col)

Unnamed: 0
Age
Sex
Job
Housing
Saving accounts
Checking account
Credit amount
Duration
Purpose

**5.Print the row indices of the dataframe**

In [11]:
data = pd.read_csv("data.csv")   
data_top = data.head()  
for row in data_top.index: 
    print(row, end = " ")

0 1 2 3 4

**6.Check the dtype of each and every columns**

In [6]:
df1.dtypes

Unnamed: 0           int64
Age                  int64
Sex                 object
Job                  int64
Housing             object
Saving accounts     object
Checking account    object
Credit amount        int64
Duration             int64
Purpose             object
dtype: object

**7.Description for Numerical Column min,max,count,25%,50%,75%,std**

In [16]:
s = pd.Series([1, 2, 3])
s.describe()

count    3.0
mean     2.0
std      1.0
min      1.0
25%      1.5
50%      2.0
75%      2.5
max      3.0
dtype: float64

**8.Description for the categorical Columns count,top,freq**

In [17]:
s = pd.Series(['a', 'a', 'b', 'c'])
s.describe()

count     4
unique    3
top       a
freq      2
dtype: object

**9.Missing value count column wise**

In [21]:
df1.isnull().sum(axis=0)

Unnamed: 0            0
Age                   0
Sex                   0
Job                   0
Housing               0
Saving accounts     183
Checking account    394
Credit amount         0
Duration              0
Purpose               0
dtype: int64

In [24]:
c = (df1 == '').sum(axis=0)
c

Unnamed: 0          0
Age                 0
Sex                 0
Job                 0
Housing             0
Saving accounts     0
Checking account    0
Credit amount       0
Duration            0
Purpose             0
dtype: int64

**10.Check the output for the info function**

In [26]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 10 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Unnamed: 0        1000 non-null   int64
 1   Age               1000 non-null   int64
 2   Sex               1000 non-null   object
 3   Job               1000 non-null   int64
 4   Housing           1000 non-null   object
 5   Saving accounts   817 non-null    object
 6   Checking account  606 non-null    object
 7   Credit amount     1000 non-null   int64
 8   Duration          1000 non-null   int64
 9   Purpose           1000 non-null   object
dtypes: int64(5), object(5)
memory usage: 78.2+ KB

**11.Access particular rows and columns using iloc,loc**

In [29]:
df1.iloc[ : , 1 ]

0      67
1      22
2      49
3      45
4      53
       ..
995    31
996    40
997    38
998    23
999    27
Name: Age, Length: 1000, dtype: int64

**12.How many unique values are there in a particular column**

In [34]:
df1['Saving accounts'].count()

817